Tekla Open API Reference for Tekla Structures 2025
InsidePartHorizontalOrWithLeaderLinePlacingType Class
 The InsidePartHorizontalOrWithLeaderLinePlacingType class defines a placing type that places the object using the base line placing as the first option. If there is no room for the first option the fallback option will be used. The fallback option is placing the object with a leader line. The base line used is in the middle of the part, aligned with the part. In addition the object will be rotated to be horizontal in the drawing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.InsidePartHorizontalOrWithLeaderLinePlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class InsidePartHorizontalOrWithLeaderLinePlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class InsidePartHorizontalOrWithLeaderLinePlacingType
	Inherits PreferredPlacingTypeBase
The InsidePartHorizontalOrWithLeaderLinePlacingType type exposes the following members.
Constructors
Name | Description
InsidePartHorizontalOrWithLeaderLinePlacingType
 Creates a new inside part horizontal or with leader line placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace